# Data Operation with Pandas

## DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
rows = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia', 2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340]
]


columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders', 'Transmission Type', 'Vehicle_Style', 'MSRP' 
]

In [3]:
# help(pd.DataFrame)

df = pd.DataFrame(data=rows, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [4]:
df.head(n=3)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990

## Series -

In [5]:
df.Make  

df.Model

df[['Make', 'Model', 'Year', 'Engine HP']]

      Make     Model  Year  Engine HP
0   Nissan    Stanza  1991      138.0
1  Hyundai    Sonata  2017        NaN
2    Lotus     Elise  2010      218.0
3      GMC    Acadia  2017      194.0
4   Nissan  Frontier  2017      261.0

In [6]:
df['ide'] = [2,3,4,5,6]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,ide
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,2
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,3
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,4
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,5
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,6

In [7]:
del df['ide']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [8]:
df['ide'] = ['a' , 'b', 'c', 'd', 'e']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,ide
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,a
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,b
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,c
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,d
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,e

In [9]:
df['ide'] = [1,2,3,4,5]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,ide
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [10]:
del df['ide']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

# Index

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.Make.index

RangeIndex(start=0, stop=5, step=1)

# iloc - Integer based location

In [13]:
df.iloc[0,6]   #integer-based location -

'sedan'

In [14]:
type(df.iloc[0,6])

str

In [15]:
df.iloc[0:3, 0:3]

      Make   Model  Year
0   Nissan  Stanza  1991
1  Hyundai  Sonata  2017
2    Lotus   Elise  2010

In [16]:
type(df.iloc[0:3, 0:3])

pandas.core.frame.DataFrame

In [17]:
df.iloc[[1]] 
#This returns a dataframe or 2D array

# If you're feeding rows into a modeling pipeline or want to keep the structure intact (e.g., for .concat() or .merge()), use df.iloc[[1]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [18]:
type(df.iloc[[1]])

pandas.core.frame.DataFrame

In [19]:
df.iloc[1] # selects integer location -- integer based location

#this returns a 1 series or 1D array

# This is mainly used when inspecting for inspecting or manipulating values.

Make                   Hyundai
Model                   Sonata
Year                      2017
Engine HP                  NaN
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
MSRP                     27150
Name: 1, dtype: object

In [20]:
type(df.iloc[1])

pandas.core.series.Series

# loc - label based location

In [21]:
Rows = [
    ["person 2", "kofi", 28, "male", "Honda"],
    ["person 3", "ama", 24, "female", "Toyota"],
       ]

Columns = [
    ["identifier", "name", "age", "sex", "car"]
]


df2 = pd.DataFrame(data = Rows, columns=Columns)
df2

  identifier  name age     sex     car
0   person 2  kofi  28    male   Honda
1   person 3   ama  24  female  Toyota

In [22]:
df2.index = ["info1", "info2"]
df2

      identifier  name age     sex     car
info1   person 2  kofi  28    male   Honda
info2   person 3   ama  24  female  Toyota

In [23]:
print(df2.columns.tolist())

[('identifier',), ('name',), ('age',), ('sex',), ('car',)]

In [24]:
df2.loc[['info1', 'info2'],:]

      identifier  name age     sex     car
info1   person 2  kofi  28    male   Honda
info2   person 3   ama  24  female  Toyota

In [25]:
df2.loc[:,['identifier', 'name']]

      identifier  name
info1   person 2  kofi
info2   person 3   ama

In [26]:
type(df2.loc[['info1', 'info2']])

pandas.core.frame.DataFrame

In [27]:
df2.loc[['info1', 'info2'],['identifier','sex']]

      identifier     sex
info1   person 2    male
info2   person 3  female

In [28]:
#We want to select continuos columns using loc. 

# But loc have to order the columns alphabetically inorder to do it successfully
df3 = df2.sort_index(axis=1)  #--columns sorted here
print(df3.columns.tolist())  #--verify

df3.loc[:, 'age':'name'] #-- now reselect based on ordering

#df2.loc[:,'identifier':'sex']

[('age',), ('car',), ('identifier',), ('name',), ('sex',)]

      age     car identifier  name
info1  28   Honda   person 2  kofi
info2  24  Toyota   person 3   ama

In [29]:
df3.columns.is_monotonic_increasing  #confirm the alphabetical order

True

In [30]:
df3.loc[['info1'],'age':"sex"]

      age    car identifier  name   sex
info1  28  Honda   person 2  kofi  male

In [31]:
df3.loc[:, 'identifier':'sex']

      identifier  name     sex
info1   person 2  kofi    male
info2   person 3   ama  female

In [32]:
#print(type(df3.columns))
# Output: <class 'pandas.core.indexes.multi.MultiIndex'>
df3.columns.is_monotonic_increasing

True

In [33]:
df3 = df3.reset_index(drop=True)

In [34]:
df3

  age     car identifier  name     sex
0  28   Honda   person 2  kofi    male
1  24  Toyota   person 3   ama  female

In [33]:
df = df.reset_index(drop=True)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

# Element Wise Operation

In [34]:
df['Engine HP'] * 2

0    276.0
1      NaN
2    436.0
3    388.0
4    522.0
Name: Engine HP, dtype: float64

In [35]:
df['MSRP'] / 2

0     1000.0
1    13575.0
2    27495.0
3    17225.0
4    16170.0
Name: MSRP, dtype: float64

In [36]:
df['Engine Cylinders'] ** 2

0    16
1    16
2    16
3    16
4    36
Name: Engine Cylinders, dtype: int64

# Filtering

In [37]:
df['Year'] >= 2015

0    False
1     True
2    False
3     True
4     True
Name: Year, dtype: bool

In [38]:
df[
    df['Year'] >= 2015
    ]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [39]:
df[
    (df['Make'] == 'Nissan') & (df['Engine Cylinders'] >= 4)
]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

# String Operation

In [40]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [41]:
df['Vehicle_Style'].str.replace(' ', '_')

# this does not overwrite - it creates a new series with new effected changes

0          sedan
1          Sedan
2    convertible
3        4dr_SUV
4         Pickup
Name: Vehicle_Style, dtype: object

In [42]:
df['Transmission Type'].str.lower()

# this does not overwrite - it creates a new series with new effected changes

0       manual
1    automatic
2       manual
3    automatic
4       manual
Name: Transmission Type, dtype: object

In [43]:
df['Make'].str.lower()
# this does not overwrite - it creates a new series with new effected changes

0     nissan
1    hyundai
2      lotus
3        gmc
4     nissan
Name: Make, dtype: object

In [44]:
df['Vehicle_Style'].str.lower().str.replace(' ', '_')  
# this does not overwrite the data - it creates a new series with new effected changes

0          sedan
1          sedan
2    convertible
3        4dr_suv
4         pickup
Name: Vehicle_Style, dtype: object

In [45]:
# -> This one here rather overwrites the data because we re-assigned it

df['Vehicle_Style'] = df['Vehicle_Style'].str.lower().str.replace(' ', '_')
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,pickup,32340

In [46]:
df['Make'] = df['Make'].str.lower()
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,hyundai,Sonata,2017,NaN,4,AUTOMATIC,sedan,27150
2,lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,gmc,Acadia,2017,194.0,4,AUTOMATIC,4dr_suv,34450
4,nissan,Frontier,2017,261.0,6,MANUAL,pickup,32340

In [47]:
df['Transmission Type'] = df['Transmission Type'].str.lower()

df['Model'] = df['Model'].str.lower() 

df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,nissan,stanza,1991,138.0,4,manual,sedan,2000
1,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
2,lotus,elise,2010,218.0,4,manual,convertible,54990
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,frontier,2017,261.0,6,manual,pickup,32340

In [48]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,nissan,stanza,1991,138.0,4,manual,sedan,2000
1,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
2,lotus,elise,2010,218.0,4,manual,convertible,54990
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,frontier,2017,261.0,6,manual,pickup,32340

In [49]:
df.columns = df.columns.str.lower()
#df = df.reset_index(drop=True)
df

,make,model,year,engine hp,engine cylinders,transmission type,vehicle_style,msrp
0,nissan,stanza,1991,138.0,4,manual,sedan,2000
1,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
2,lotus,elise,2010,218.0,4,manual,convertible,54990
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,frontier,2017,261.0,6,manual,pickup,32340

In [63]:
df.columns = df.columns.str.lower().str.replace(' ', '_')
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,nissan,stanza,1991,138.0,4,manual,sedan,2000
1,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
2,lotus,elise,2010,218.0,4,manual,convertible,54990
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,frontier,2017,261.0,6,manual,pickup,32340

# Summarizing Operations

In [50]:
df.msrp.mean()

np.float64(30186.0)

In [51]:
df['msrp'].mean()

np.float64(30186.0)

In [52]:
df.msrp.describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: msrp, dtype: float64

In [53]:
df['msrp'].describe()

count        5.000000
mean     30186.000000
std      18985.044904
min       2000.000000
25%      27150.000000
50%      32340.000000
75%      34450.000000
max      54990.000000
Name: msrp, dtype: float64

In [55]:
df.describe().round(2)  #for numeric

          year  engine hp  engine cylinders      msrp
count     5.00       4.00              5.00      5.00
mean   2010.40     202.75              4.40  30186.00
std      11.26      51.30              0.89  18985.04
min    1991.00     138.00              4.00   2000.00
25%    2010.00     180.00              4.00  27150.00
50%    2017.00     206.00              4.00  32340.00
75%    2017.00     228.75              4.00  34450.00
max    2017.00     261.00              6.00  54990.00

In [56]:
df.nunique()  #unique values in all columns

make                 4
model                5
year                 3
engine hp            4
engine cylinders     2
transmission type    2
vehicle_style        4
msrp                 5
dtype: int64

In [57]:
df.model.nunique()

5

# Missing Values

In [61]:
df.isnull()

,make,model,year,engine hp,engine cylinders,transmission type,vehicle_style,msrp
0,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [62]:
df.isnull().sum()

make                 0
model                0
year                 0
engine hp            1
engine cylinders     0
transmission type    0
vehicle_style        0
msrp                 0
dtype: int64

# Grouping

```
SELECT 
    transmission_type, AVG(MSRP)
FROM
    cars
GROUP BY
    transmission_type
```

In [66]:
#Group Transmission type according to average msrp

cars = df.groupby('transmission_type').msrp.mean()
cars

transmission_type
automatic    30800.000000
manual       29776.666667
Name: msrp, dtype: float64

In [76]:
type(cars)

pandas.core.series.Series

In [67]:
df

,make,model,year,engine_hp,engine_cylinders,transmission_type,vehicle_style,msrp
0,nissan,stanza,1991,138.0,4,manual,sedan,2000
1,hyundai,sonata,2017,NaN,4,automatic,sedan,27150
2,lotus,elise,2010,218.0,4,manual,convertible,54990
3,gmc,acadia,2017,194.0,4,automatic,4dr_suv,34450
4,nissan,frontier,2017,261.0,6,manual,pickup,32340

In [70]:
df.groupby('make').engine_cylinders.min()

make
gmc        4
hyundai    4
lotus      4
nissan     4
Name: engine_cylinders, dtype: int64

In [71]:
df.groupby('make').engine_hp.max()

make
gmc        194.0
hyundai      NaN
lotus      218.0
nissan     261.0
Name: engine_hp, dtype: float64

In [78]:
df.groupby('vehicle_style').engine_cylinders.max()

vehicle_style
4dr_suv        4
convertible    4
pickup         6
sedan          4
Name: engine_cylinders, dtype: int64

# Getting Numpy Arrays

In [72]:
df.msrp

0     2000
1    27150
2    54990
3    34450
4    32340
Name: msrp, dtype: int64

In [74]:
#if we want the underlying numpy arrays
df.msrp.values

array([ 2000, 27150, 54990, 34450, 32340])

In [77]:
#Convert pandas dataframe to dictionary 
df.to_dict(orient='records')

[{'make': 'nissan',
  'model': 'stanza',
  'year': 1991,
  'engine_hp': 138.0,
  'engine_cylinders': 4,
  'transmission_type': 'manual',
  'vehicle_style': 'sedan',
  'msrp': 2000},
 {'make': 'hyundai',
  'model': 'sonata',
  'year': 2017,
  'engine_hp': nan,
  'engine_cylinders': 4,
  'transmission_type': 'automatic',
  'vehicle_style': 'sedan',
  'msrp': 27150},
 {'make': 'lotus',
  'model': 'elise',
  'year': 2010,
  'engine_hp': 218.0,
  'engine_cylinders': 4,
  'transmission_type': 'manual',
  'vehicle_style': 'convertible',
  'msrp': 54990},
 {'make': 'gmc',
  'model': 'acadia',
  'year': 2017,
  'engine_hp': 194.0,
  'engine_cylinders': 4,
  'transmission_type': 'automatic',
  'vehicle_style': '4dr_suv',
  'msrp': 34450},
 {'make': 'nissan',
  'model': 'frontier',
  'year': 2017,
  'engine_hp': 261.0,
  'engine_cylinders': 6,
  'transmission_type': 'manual',
  'vehicle_style': 'pickup',
  'msrp': 32340}]